In [1]:
import numpy as np

In [2]:
import pandas as pd

# Creation of Dataframe (2-d data structure)

DataFrame is a 2d data structure where data is aligned in the form of a tabular fashion in rows & columns.

In [3]:
#pd.DataFrame(data,index,column,dtype)

#dataframe can be created from a list, list of lists, dictionaries ,from another series, from numpy array etc

# Create DataFrame using a list

In [4]:
list1=[1,2,3,4,5]

In [5]:
df1=pd.DataFrame(list1)

In [6]:
print(df1)

   0
0  1
1  2
2  3
3  4
4  5

In [7]:
df1

   0
0  1
1  2
2  3
3  4
4  5

In [8]:
df2=pd.DataFrame(list1,index=[10,20,30,40,50],columns=['count'],dtype=float)

In [9]:
df2

    count
10    1.0
20    2.0
30    3.0
40    4.0
50    5.0

# Create a DataFrame from numpy array

In [10]:
arr1=np.array([[1,2,3],[4,5,6]])

In [11]:
df3=pd.DataFrame(arr1,index=['row1','row2'],columns=['c1','c2','c3'])

In [12]:
df3

      c1  c2  c3
row1   1   2   3
row2   4   5   6

In [13]:
arr2=np.array([1,2,3])

In [14]:
df4=pd.DataFrame(arr2)

In [15]:
df4

   0
0  1
1  2
2  3

# Create a DataFrame from list of lists

In [16]:
list2=[['Sai',30],['king',31],['Div',28.0]]

In [17]:
df5=pd.DataFrame(list2,columns=['name','age'])

In [18]:
df5

   name   age
0   Sai  30.0
1  king  31.0
2   Div  28.0

# Create a DataFrame from a dictionary

In [19]:
dict1={'Names':['Code','Hack','Data','Police'],'Age':[1,2,3,4]}

In [20]:
print(dict1)

{'Names': ['Code', 'Hack', 'Data', 'Police'], 'Age': [1, 2, 3, 4]}

In [21]:
df6=pd.DataFrame(dict1)

In [22]:
df6

    Names  Age
0    Code    1
1    Hack    2
2    Data    3
3  Police    4

#dont insert columns in DataFrame when using a dictionary as the keys will be used as column names.
as indexes for in case of Series.

In [23]:
dict2={'Names':['Code','Hack','Data','Police'],'Age':[1,2,3,4,5]}

In [24]:
print(dict2)

{'Names': ['Code', 'Hack', 'Data', 'Police'], 'Age': [1, 2, 3, 4, 5]}

In [25]:
#df7=pd.DataFrame(dict2)

#upper Dataframe for the dict2 throws an value error because the arrays or values for keys must be all of same length

# Create a dataframe from a list of dictionaries

In [26]:
a=[{'a':1,'b':2,'c':3},{'a':25,'b':26,'d':35,'e':69}]

In [27]:
df8=pd.DataFrame(a)

In [28]:
df8

    a   b    c     d     e
0   1   2  3.0   NaN   NaN
1  25  26  NaN  35.0  69.0

#whenever there is missing value or NaN in a column then entire column is changed to float datatype.

In [29]:
a01=[{'a':1,'b':2,'c':3},{'a':25,'b':26,'d':35,'e':69}]

In [30]:
df08=pd.DataFrame(a01,index=['1','5'])

In [31]:
df08

    a   b    c     d     e
1   1   2  3.0   NaN   NaN
5  25  26  NaN  35.0  69.0

# Create a DataFrame using a dictonary of Series

In [32]:
a2={'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}

In [33]:
print(a2)

{'one': a    1
b    2
c    3
dtype: int64, 'two': a    1
b    2
c    3
d    4
dtype: int64}

In [34]:
df9=pd.DataFrame(a2)

In [35]:
df9

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [36]:
a3={'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}

In [37]:
df10=pd.DataFrame(a3,index=['10','20','30'])

In [38]:
df10

    one  two
10  NaN  NaN
20  NaN  NaN
30  NaN  NaN

# functions in DataFrame

In [39]:
states={'state':['AP','TN','TL','MP','UP','GUJ'],'year':[1956,1947,2014,1951,1950,1965],'gdp':[4500,7000,6500,4000,5000,8000]}

In [40]:
print(states)

{'state': ['AP', 'TN', 'TL', 'MP', 'UP', 'GUJ'], 'year': [1956, 1947, 2014, 1951, 1950, 1965], 'gdp': [4500, 7000, 6500, 4000, 5000, 8000]}

In [41]:
df11=pd.DataFrame(states)

In [42]:
df11

  state  year   gdp
0    AP  1956  4500
1    TN  1947  7000
2    TL  2014  6500
3    MP  1951  4000
4    UP  1950  5000
5   GUJ  1965  8000

In [43]:
df11.head()

  state  year   gdp
0    AP  1956  4500
1    TN  1947  7000
2    TL  2014  6500
3    MP  1951  4000
4    UP  1950  5000

In [44]:
#df11.head() gives only top 5 values

In [45]:
df11.tail()

  state  year   gdp
1    TN  1947  7000
2    TL  2014  6500
3    MP  1951  4000
4    UP  1950  5000
5   GUJ  1965  8000

In [46]:
#gives bottom 5

In [47]:
df11.head(2)

  state  year   gdp
0    AP  1956  4500
1    TN  1947  7000

In [48]:
df11.tail(3)

  state  year   gdp
3    MP  1951  4000
4    UP  1950  5000
5   GUJ  1965  8000

In [49]:
df11.columns

Index(['state', 'year', 'gdp'], dtype='object')

In [50]:
df11['state']

0     AP
1     TN
2     TL
3     MP
4     UP
5    GUJ
Name: state, dtype: object

In [51]:
df11[['state','year']]

  state  year
0    AP  1956
1    TN  1947
2    TL  2014
3    MP  1951
4    UP  1950
5   GUJ  1965